"""# Задача 1: Счётчик чисел
Напишите программу, которая с помощью цикла while выводит числа от 1 до 10.
"""

number = 1

while number <= 10:
    print(number)
    # изменение условия, чтобы цикл остановился
    number = number + 1