# Задание 1: Представление профиля пользователя
"""
Создайте переменные:
- username = "Алиса"
- points = 145
Используя старый стиль форматирования, создайте строку:
"Пользователь Алиса заработал 145 баллов."
"""

username = "Алиса"
mark1 = 5
mark2 = 4
mark3 = 4
average = (mark1 + mark2 + mark3) / 3

print("Srednij bal polsovatelja %s, raven %f ballov"% (username, average))

username = "Алиса"
mark1 = 5
mark2 = 4
mark3 = 4
average = (mark1 + mark2 + mark3) / 3

print("Средний балл пользователя %s, равен:  %f баллов" %(username, average))