
# Задание 4: Разделение строки
"""
Создайте строку с текстом "яблоко,банан,вишня".
- Разбейте её на отдельные слова, используя запятую как разделитель.
- Выведите полученный список.
"""
# Ваш код здесь


text = яблоко,банан,вишня
new_str = str.replace(",", ";")

print("str = " + str)
print("new_str = " + new_str)
