
#Старый стиль форматирования:
#Напишите программу, которая сохраняет ваше имя, возраст и любимое число в переменных и форматирует предложение с помощью старого стиля % так, чтобы получилось:
#"Меня зовут [Имя], мне [Возраст] лет, а моё любимое число — [Число]."

name = "Jenny"
age = 38
number = 5.55555

print("Меня зовут %s, мне %d лет, моё любимое число %.2f" % (name, age, number))


