#1. Личные данные
#Напишите программу, которая запрашивает у пользователя его имя, возраст и любимый цвет.
#Выведите сообщение: "Меня зовут [Имя], мне [Возраст] лет, и мой любимый цвет — [Цвет]."

name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")
favorite_color = input("Введите ваш любимый цвет: ")

print(f"Меня зовут {name}, мне {age} лет, и мой любимый цвет — {favorite_color}.")