 #Задание 1: Приветствие пользователя
"""
Запросите у пользователя его имя и фамилию.
Сформируйте строку вида: "Здравствуйте, [Имя] [Фамилия]!" и выведите её.
"""

name = input ("Enter your name please: ")
surname = input ("Enter your surname please: ")
print (f"Здравствуйте, {name} {surname}!")